_posts/2022-02-06-abc-b-upsolving.html
---
layout: post
title: abc238 B - Pizza
tags: 수학
---

<div id="outline-container-org5be95ba" class="outline-2">
<h2 id="org5be95ba">B - Pizza</h2>
</div>

<div id="outline-container-orgecc9106" class="outline-2">
<h2 id="orgecc9106">접근하기</h2>
<div class="outline-text-2" id="text-orgecc9106">
<pre class="example">
피자를 회전(시계방향)해서 12시 방향에서 cut하기는 생각하기 어렵다.

이미 cut되어 있는 방향을 돌린다고 생각(반시계방향)

처음 위치 ang[0] = 1

ang[0 + p1] = 1

ang[0 + p1 + p2] = 1 

...

(0 + p1 + p2 ...) % 360을 하면, 원래 위치를 넘어서 cut할 수 있다.

1인 두 점 사이의 거리가 가장 큰 것을 구해서 출력x
</pre>
</div>
</div>

<div id="outline-container-org1466fc6" class="outline-2">
<h2 id="org1466fc6">코드</h2>
<div class="outline-text-2" id="text-org1466fc6">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">FASTIO</span> <span style="color: #8ae234;">ios_base</span>::sync_with_stdio(<span style="color: #8ae234;">false</span>); cin.tie(<span style="color: #8ae234;">NULL</span>);
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">INF</span> 1e9

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ang</span>[360];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #8ae234; font-weight: bold;">FASTIO</span>

    <span style="color: #ff6347;">ang</span>[0] = 1;

    cin &gt;&gt; N;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">cur</span> = 0;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        cin &gt;&gt; num;
        cur += num;
        cur = cur % 360;    <span style="color: #888a85;">// </span><span style="color: #888a85;">&#50896;&#54805;&#51004;&#47196; &#46028;&#47532;&#45716; &#44163; 360 -&gt; 0</span>
        ang[cur] = 1;
    }

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">prev</span> = 0;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ans</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=360;i++) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (ang[i%360] != 0) {
            ans = max(ans, i - prev);
            prev = i;
        }
    }
    cout &lt;&lt; ans &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>;
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org676a26d" class="outline-2">
<h2 id="org676a26d">문제 링크</h2>
<div class="outline-text-2" id="text-org676a26d">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc238/tasks/abc238_b">https://atcoder.jp/contests/abc238/tasks/abc238_b</a></li>
</ul>
</div>
</div>
